IOS File System

show file system

dir <flash0>

/ : root

dir flash0:/config/
The IOS file system allows for the storage, retrieval, and manipulation of files by IOS and by administrators. 
Files are stored in different locations, specified by a prefix. There are many potential prefixes. 
The hardware and configuration of a device will control the local prefixes that are available, and the network and server configuration will control the available remote prefixes. 
Prefix specifications end with a colon character (:).

flash:
nvram:
system:
tftp:
ftp:
scp:

examples include:
flash:/c2900-universalk9-mz.SPA.153-1.T.bin
nvram:/startup-config
system:/running-config


tftp://10.10.10.10/backup-cfg.txt
ftp://10.10.20.20/admin:Adm1nPwd/c2900-universalk9-mz.SPA.154-1.T.bin
scp://cfg-srv/admin:Adm1nPwd/c2900-universalk9-mz.SPA.154-1.T2.bin


Copying Files to and from Network Devices:


RCP : remote copy protocol


copy system:/running-config nvram:/startup-config == copy running-config startup-config == copy run start

The running configuration can also be backed up to a remote SCP server with a command similar to 
copy running-config scp://cfg-srv/admin:Adm1nPwd/Rtr-1-cfg.txt.


To restore a backed-up configuration, the administrator can issue a command similar to 
copy scp://cfg-srv/admin:Adm1nPwd/Rtr-1-cfg.txt startup-config followed by the reload command.

Another option is to use the more recently introduced configure replace command, which performs a differential operation between the archived configuration file and the running configuration. 
The differentials are then applied to the running configuration.
A reload is not necessary, so continuity of service is provided. For example,
configure replace scp://cfg-srv/admin:Adm1nPwd/Rtr-1-cfg.txt will retrieve the file Rtr-1-cfg.txt 
from the SCP server and apply the appropriate changes to the running configuration. 
The archived configuration must be a full IOS configuration in the same syntax as generated by the show running-config command.

Validating IOS Images Using MD5:

Rtr-1#verify /md5 flash:/c2800nm-advipservicesk9-mz.124-25e.bin

Digitally Signed Images:

Rtr-1#software authenticity file flash:/c2900-universalk9-mz.SPA.153-1.T.bin

Digitally Signed Images:

Rtr-1#show software authenticity running

 A digitally signed image can be recognized by a three-character string within the filename: c2900-universalk9-mz.SPA.153-1.T.bin
The characters are defined as follows:

S: Designates that this is a digitally signed image
P: Designates that this is a production image. The second character may also be an S, indicating a special image which is not intended for general deployment.
A: Designates the key version. Signing keys can be revoked. When the time comes for the signing key to be replaced, this character will be incremented alphabetically. The second signing key version will be designated with a B.


IOS Resilient Configuration:
If attackers can gain administrative access to a router via an SSH or a Telnet connection, there are many options open to them. 
Which options are worst for the victim is debatable, but certainly one drastic option is for the attacker to erase the startup configuration on the device and erase the boot image file and then reload the device. 
The device will then reload and it does not even have an operating system to boot, let alone a configuration to run once booting completes. 
The IOS resilient configuration feature is intended to simplify recovery in the event of this type of attack.

OS resilient configuration is enabled with two commands. 
The first command, secure boot-image, enables the feature and secures the running image.
The image is still maintained in flash, but it is now protected.
It is no longer displayed in the flash directory and cannot be deleted via the command line. 
If flash is reformatted from the command line, all visible files will be erased, but the secured boot image will remain. 
The second command, secure boot-config, copies the running configuration to the secured storage location. 
The combination of the secured IOS image and the secured configuration is called the secure bootset.

Rtr-1#dir
Directory of flash:/

    1  -rw-    38149592  Oct 31 2014 14:23:02 +00:00  c2800nm-advipservicesk9-mz.124-25e.bin

256503808 bytes total (218353664 bytes free)
Rtr-1#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Rtr-1(config)#secure boot-image
*Oct 31 14:24:44.212: %IOS_RESILIENCE-5-IMAGE_RESIL_ACTIVE: Successfully secured running image
Rtr-1(config)#secure boot-config
*Oct 31 14:24:59.768: %IOS_RESILIENCE-5-CONFIG_RESIL_ACTIVE: Successfully secured config archive [flash:.runcfg-20141031-142459.ar]
Rtr-1(config)#end
*Oct 31 14:25:08.580: %SYS-5-CONFIG_I: Configured from console by console
Rtr-1#dir
Directory of flash:/

No files in directory

256503808 bytes total (218345472 bytes free)


